[
    {
        "id": 1,
        "reponame": "sechevarria98/website",
        "link": "https://github.com/sechevarria98/website",
        "title": "Personal Website",
        "description": "This project serves as an update to my original personal website. To become more proficient in using React.js, I used this framework to create the website you are currently viewing. ",
        "technincal": ["React.js", "JavaScript", "JSX", "CSS", "GitHub Pages", "JSON"]
    },
    {
        "id": 2,
        "reponame": "dserapio/websitecalc",
        "link": "https://github.com/dserapio/websitecalc",
        "title": "Global Impact Calculator",
        "description": " The e-stewards Global Impact Calculator started as a project for my Inter-Professional Project (IPRO) course. The amount of work to deliver a quality web app carried over into the summer of 2020. Over the summer, the work consisted of researching the yield amount of various e-waste and building a calculator for people to determine the yields of their e-waste. During this process, the team and I met with representatives from e-Stewards. In these biweekly meetings, we discussed various aspects of the calculator and research.",
        "technincal": ["React.js", "JavaScript", "JSX", "CSS", "GitHub Pages", "JSON"]
    },
    {
        "id": 3,
        "reponame": "sechevarria98/CourseraReviews",
        "link": "https://github.com/sechevarria98/CourseraReviews",
        "title": "Coursera Reviews",
        "description": "Project performing sentiment analysis on several Coursera reviews. Coursera is an online course provider and the dataset for the reviews provided through a user on Kaggle.",
        "technincal": ["Python", "Jupyter Notebook"]
    },
    {
        "id": 4,
        "reponame": "sechevarria98/Language",
        "link": "https://github.com/sechevarria98/Language",
        "title": "Language",
        "description": "Discord Bot used to moderate a Discord server.",
        "technincal": ["Python", "Discord.py"]
    },
    {
        "id": 5,
        "reponame": "sechevarria98/StockWatch",
        "link": "https://github.com/sechevarria98/StockWatch",
        "title": "Stock Watch",
        "description": "An Android mobile app made to function as any other stock watch. The app displays all performance data of a selected stock by making a call to a stock API which returns all relevant data.",
        "technincal": ["Java", "Android Studio"]
    },
    {
        "id": 6,
        "reponame": "sechevarria98/NewsGateway",
        "link": "https://github.com/sechevarria98/NewsGateway",
        "title": "News Gateway",
        "description": "An Android mobile app made to display news articles based on genre and the news outlet. Based on the user's filter, the app will display a column-based list of several news articles. From there, a user can pick an article that will then show more relevant information. Upon a further click, the app will send the user to the full article.",
        "technincal": ["Java", "Android Studio"]
    },
    {
        "id": 7,
        "reponame": "sechevarria98/KnowYourGovernment",
        "link": "https://github.com/sechevarria98/KnowYourGovernment",
        "title": "Know Your Government",
        "description": "An Android mobile app made to display Government officials based on their current area. Users can also search other locations to see the different officials. On startup, a column-based list shows the government officials in a hierarchal order. A user can then click on an official to see much more relevant information.",
        "technincal": ["Java", "Android Studio"]
        
    },
    {
        "id": 8,
        "reponame": "sechevarria98/SmartParking",
        "link": "https://github.com/sechevarria98/SmartParking",
        "title": "Smart Parking",
        "description": "A smart parking application made to function like other parking applications. The start of the project involved creating the relational schema to set up the backend. From there, I used the toolkit Swing to create the GUI for the frontend. With Java, I can communicate with the PostgreSQL database for the backend.",
        "technincal": ["Java", "SQL", "PostgreSQL"]
    },
    {
        "id": 9,
        "reponame": "sechevarria98/OnlineGroceryStore",
        "link": "https://github.com/sechevarria98/OnlineGroceryStore",
        "title": "Online Grocery Store",
        "description": "This project depicts an Online Grocery Store. The project began through the process of designing the relational schema. From there, using some wireframing tools, a blueprint of how the frontend should look is made. With Java, the backend is managed by being able to communicate with the PostgreSQL database.",
        "technincal": ["Java", "SQL", "PostgreSQL"]
    }
]